# Parameter Type Id Joint Gap Param Property

Source: https://www.revitapidocs.com/2026/d3479982-f9ec-89f4-663e-7af613389f3c.htm

---

| Parameter Type Id Joint Gap Param Property |
| --- |

"Joint Gap"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId JointGapParam { get; }
```

```
Public Shared ReadOnly Property JointGapParam As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ JointGapParam {
	ForgeTypeId^ get ();
}
```

```
static member JointGapParam : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace